#include<stdio.h>
main()
{
	int a[3], * p;
	p = a;
	a[0] = 10, a[1] = 20, a[3] = 30;
	printf("*p・・・%d\n", *p);			//アドレスを取り出す

	p = a;
	a[0] = 10, a[1] = 20, a[3] = 30;
	printf("*p+1・・・%d\n", *p+1);		//アドレスを取り出してから1足される

	p = a;
	a[0] = 10, a[1] = 20, a[3] = 30;
	printf("*(p+1)・・・%d\n", *(p+1));	//アドレスを一つ分進めてから取り出す

	p = a;
	a[0] = 10, a[1] = 20, a[3] = 30;
	printf("*p+=1・・・%d\n", *p+=1);	//アドレスを取り出してから１足される

	p = a;
	a[0] = 10, a[1] = 20, a[3] = 30;
	printf("*p++・・・%d\n", *p++);		//後置きはほかの処理が先に行われる

	p = a;
	a[0] = 10, a[1] = 20, a[3] = 30;
	printf("(*p)++・・・%d\n", (*p)++);	//後置きはほかの処理が先に行われる

	p = a;
	a[0] = 10, a[1] = 20, a[3] = 30;
	printf("*++p・・・%d\n", *++p);		//前置きは先に計算が行われる

	p = a;
	a[0] = 10, a[1] = 20, a[3] = 30;	//前置きは先に計算が行われる
	printf("++*p・・・%d\n", ++*p);
}